export interface Position {
  id: string;
  title: string;
  requirements: string;
  termsOfService: string;
  suitableFor: string;
}
export const positions: Position[] = [
  {
    id: "1",
    title: "Кулеметник",
    requirements:
      "Використання кулемета для підтримки бойових дій, забезпечення вогневої підтримки піхоти та оборони позицій. Кулеметник виконує завдання з придушення вогневих точок противника, веде вогонь по групах супротивника та координує свої дії з іншими членами підрозділу",
    termsOfService:
      "Служба в бойових підрозділах, тісна командна взаємодія, інколи — в складних умовах.",
    suitableFor:
      "Тим, хто може зосереджено працювати під навантаженням, має витривалість і прагне бути опорою для команди.",
  },
  {
    id: "2",
    title: "Стрілець",
    requirements:
      "Виконання завдань з охорони позицій, патрулювання, оборони та участі в бойових операціях. Стрілець має бути готовим до виконання різноманітних завдань у складі бойового колективу.",
    termsOfService:
      "Робота на передовій або в тилу, завжди в складі бойового колективу.",
    suitableFor:
      "Уважним, відповідальним людям, які готові навчатися та діяти в злагоді з іншими.",
  },
  {
    id: "3",
    title: "Розвідник",
    requirements:
      "Збір інформації про дії противника, вивчення місцевості, допомога в плануванні операції. Розвідник має бути готовим до роботи в умовах невизначеності та ризику.",
    termsOfService:
      "Мобільна, часто тиха й непомітна робота в малих групах. Вимагає уважності та витримки.",
    suitableFor:
      "Тими, хто швидко мислить, уміє працювати в умовах невизначеності та довіряє інтуїції.",
  },
  {
    id: "4",
    title: "Оператор БПЛА (розвідка)",
    requirements:
      "Керування безпілотниками для спостереження з повітря, передача інформації для прийняття рішень. Оператор БПЛА має бути уважним до деталей і мати технічні навички.",
    termsOfService:
      "Робота з технікою — зазвичай на безпечній відстані від передової, але відповідальна.",
    suitableFor:
      "Уважним до деталей людям, які люблять технології та вміють зберігати зосередженість.",
  },
  {
    id: "5",
    title: "Оператор БПЛА (ударного типу)",
    requirements:
      "Застосування дронів для точкових ударів по цілях противника. Оператор БПЛА має бути виваженим і мати стратегічне мислення.",
    termsOfService:
      "Дистанційна робота, яка вимагає виваженості, точності та аналітичного мислення.",
    suitableFor:
      "Тими, хто має спокійну реакцію, мислить стратегічно і вміє відповідально працювати з технікою.",
  },
  {
    id: "6",
    title: "Бойовий медик",
    requirements:
      "Надання першої медичної допомоги на полі бою, стабілізація поранених, евакуація бійців до безпечної зони, контроль стану здоров’я підрозділу, проведення профілактичних заходів та робота з бойовим стресом.",
    termsOfService:
      "Робота безпосередньо в складі бойової групи або на евакуаційній лінії. Високе психологічне навантаження, але й надзвичайно важлива місія — рятувати життя побратимів.",
    suitableFor:
      "Тими, хто в критичні моменти зберігає ясну голову, вміє приймати рішення під тиском і має бажання допомагати іншим. Медична освіта або проходження курсів TCCC/CLS буде перевагою, але готові навчати з нуля — головне бажання та витримка.",
  },
  {
    id: "7",
    title: "Військовий водій",
    requirements:
      "Перевезення особового складу, вантажів, допомога в евакуації людей чи техніки з небезпечних зон.",
    termsOfService:
      "Постійна динаміка, іноді — рух у складних умовах або під час бойових завдань.",
    suitableFor:
      "Тими, хто має досвід водіння, орієнтується в дорозі й прагне бути підтримкою для підрозділу.",
  },
  {
    id: "8",
    title: "Сапер",
    requirements:
      "Пошук і знешкодження вибухонебезпечних предметів, створення безпечного простору для інших, прокладання безпечних шляхів.",
    termsOfService:
      "Робота в тилу або на передовій — завжди зосереджена й відповідальна.",
    suitableFor:
      "Тими, хто має холодний розум, любить порядок і не боїться працювати обережно та вдумливо.",
  },
];
